chapters/terminal.org
# -*- org-link-file-path-type: relative; -*-
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: Terminal
#+date: <2023-02-14 Tue>
#+author: Britt Anderson
#+email: britt@uwaterloo.ca
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.2 (Org mode 9.6-pre)
#+bibliography: /home/britt/gitRepos/Intro2Computing4Psychology/chapters/i2c4p.bib
#+cite_export: csl assets/chicago-note-bibliography-16th-edition.csl

* Introduction to the Terminal
In the early days of computing computers were large devices that were maintained centrally. An early innovation that greatly increased their usage was to permit multiple users to talk to the /mainframe/ at the same time. The hubs used for this communication were called "terminals", and the venacular has been retained even though the implementations are very different. Today a /terminal/ refers to software that simulates that interface and lets you speak to your computer in the same direct way via a /command line/ interface. Graphical User Interfaces (GUIs) seem convenient in the beginning as you can visually parse them and make a reasonable guess how it is to do what you want done, but once you move beyond one off tasks and adjustments you will likely find the keyboard a much more efficient way of interacting with your laptop. It also permits you to write small bits of code that lets you script actions. For example, a few lines of a shell script would permit you to resize and rename all the files in a directory that were .jpgs. For example, if you wanted to create a directory of thumbnail images to accompany all your thousands of high resolution photos. Imagine doing that one at a time by pointing and clicking. In this module we will get some experience what a terminal is and some very basic usage. Hopefully you will continue to explore the terminal as the course progresses by looking for ways to do what I suggest via the terminal interface. 

* Find the terminal

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/453837330?h=04747d67ad" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/453837330">Da : Terminal Introduction (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>A brief introduction to the terminal material.</p>
#+end_export

  Different operating systems refer to the terminal differently. In Windows the =CMD.exe= [fn:1] command is an approximation to a terminal as is the =Power Shell= [fn:2]. 

  For OSX you navigate to you applications, find the folder "Utilities" and look in their for the terminal application. 

  For Xubuntu click the icon in the upper left of the screen and type terminal in the search bar.

** Terminology
   While they do not mean exactly the same thing, you will often find the following terms being used relatively interchangeably. 
   - terminal
   - shell
   - command line
  What they have in common is the idea of a text based interface to communicating with the operating system. What this means is that instead of opening a gui (gui: *G* raphical *U* ser *I* nterface) to navigate your file tree you do this with a text based system of commands. 

** An example - your directory tree

#+begin_src sh :eval :never :export code
   ls
#+end_src

  Typing this command in your terminal will list the files and directory. 

#+begin_src sh :eval :never :export code
   ls -la
#+end_src

  Typing this command will get you a *l* ong version of the same list, /plus/ all the hidden files that can be hard to see from a conventional file manager display. 

** An Historical Aside
   In the early days of computing people wrote their programs on [[https://en.wikipedia.org/wiki/Computer_programming_in_the_punched_card_era][punch cards]]. Some see the inspiration as the [[https://en.wikipedia.org/wiki/Jacquard_machine][Jacquard machine.]] There are still programmers alive who can tell you their horror stories of tripping and falling and scattering their punch cards everywhere. Want to know if your program worked? Take it to the main frame data center, drop it off, and come back the next day to get your print out. 
   [[https://en.wikipedia.org/wiki/Computer_terminal][Terminals]] came along as an alternative to communicating with big central processors. There was a screen and keyboard. By typing you could send input to the computer that returned the output to your screen. 
   The terminals we have today are not true terminals, but emulators. Though few people refer to them as such. We emulate this old way of communicating to the processor because it works and is efficient.

* Why use a terminal?
  
  You can get more done. You can get it done more quickly. Once you learn to do one hard thing you never have to figure out how to do it again, because you can [[https://www.theatlantic.com/technology/archive/2018/10/agents-of-automation/568795/][easily script it]]. That is why you want to learn to use the terminal

  Terminals are ubiquitous. They are low in their resource usage. They permit remote logins without the need for sending graphics back and forth. In fact, the remote computer need not have a system installed for displaying windows or even a physical screen attached (called headless). 

  Knowing how to use a terminal will allow you to use =ssh= to connect to remote hosts. It will allow you to quickly and efficiently navigate your system, and it will make it easy for you to do things that used to take ages. 

  
