book/terminal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-14 Tue 05:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Terminal</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Terminal</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org370191d">1. Introduction to the Terminal</a></li>
<li><a href="#org6029ff0">2. Find the terminal</a>
<ul>
<li><a href="#org8730c9e">2.1. Terminology</a></li>
<li><a href="#org57ef9d1">2.2. An example - your directory tree</a></li>
<li><a href="#org57586ca">2.3. An Historical Aside</a></li>
</ul>
</li>
<li><a href="#org8f7ba9c">3. Why use a terminal?</a>
<ul>
<li><a href="#org7bf4240">3.1. A scripting example</a></li>
</ul>
</li>
<li><a href="#orgd48f0eb">4. Resources</a></li>
<li><a href="#org94ecb04">5. Terminal Games</a></li>
<li><a href="#org66ee84b">6. Assessment: Terminal Assessment</a>
<ul>
<li><a href="#orgfe01d78">6.1. Goal</a></li>
<li><a href="#orge550b55">6.2. Tasks</a>
<ul>
<li><a href="#org30d6916">6.2.1. Submit a file that answers the following questions:</a></li>
<li><a href="#org9cdf6b1">6.2.2. Submit a file that does the following:</a></li>
<li><a href="#org93b8549">6.2.3. Last Thoughts</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org370191d" class="outline-2">
<h2 id="org370191d"><span class="section-number-2">1.</span> Introduction to the Terminal</h2>
<div class="outline-text-2" id="text-1">
<p>
In the early days of computing computers were large devices that were maintained centrally. An early innovation that greatly increased their usage was to permit multiple users to talk to the <i>mainframe</i> at the same time. The hubs used for this communication were called "terminals", and the venacular has been retained even though the implementations are very different. Today a <i>terminal</i> refers to software that simulates that interface and lets you speak to your computer in the same direct way via a <i>command line</i> interface. Graphical User Interfaces (GUIs) seem convenient in the beginning as you can visually parse them and make a reasonable guess how it is to do what you want done, but once you move beyond one off tasks and adjustments you will likely find the keyboard a much more efficient way of interacting with your laptop. It also permits you to write small bits of code that lets you script actions. For example, a few lines of a shell script would permit you to resize and rename all the files in a directory that were .jpgs. For example, if you wanted to create a directory of thumbnail images to accompany all your thousands of high resolution photos. Imagine doing that one at a time by pointing and clicking. In this module we will get some experience what a terminal is and some very basic usage. Hopefully you will continue to explore the terminal as the course progresses by looking for ways to do what I suggest via the terminal interface. 
</p>
</div>
</div>

<div id="outline-container-org6029ff0" class="outline-2">
<h2 id="org6029ff0"><span class="section-number-2">2.</span> Find the terminal</h2>
<div class="outline-text-2" id="text-2">
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/453837330?h=04747d67ad" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/453837330">Da : Terminal Introduction (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>A brief introduction to the terminal material.</p>

<p>
Different operating systems refer to the terminal differently. In Windows the <code>CMD.exe</code> <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> command is an approximation to a terminal as is the <code>Power Shell</code> <sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>. 
</p>

<p>
For OSX you navigate to you applications, find the folder "Utilities" and look in their for the terminal application. 
</p>

<p>
For Xubuntu click the icon in the upper left of the screen and type terminal in the search bar.
</p>
</div>

<div id="outline-container-org8730c9e" class="outline-3">
<h3 id="org8730c9e"><span class="section-number-3">2.1.</span> Terminology</h3>
<div class="outline-text-3" id="text-2-1">
<p>
While they do not mean exactly the same thing, you will often find the following terms being used relatively interchangeably. 
</p>
<ul class="org-ul">
<li>terminal</li>
<li>shell</li>
<li>command line</li>
</ul>
<p>
What they have in common is the idea of a text based interface to communicating with the operating system. What this means is that instead of opening a gui (gui: <b>G</b> raphical <b>U</b> ser <b>I</b> nterface) to navigate your file tree you do this with a text based system of commands. 
</p>
</div>
</div>

<div id="outline-container-org57ef9d1" class="outline-3">
<h3 id="org57ef9d1"><span class="section-number-3">2.2.</span> An example - your directory tree</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh">ls
</pre>
</div>

<p>
Typing this command in your terminal will list the files and directory. 
</p>

<div class="org-src-container">
<pre class="src src-sh">ls -la
</pre>
</div>

<p>
Typing this command will get you a <b>l</b> ong version of the same list, <i>plus</i> all the hidden files that can be hard to see from a conventional file manager display. 
</p>
</div>
</div>

<div id="outline-container-org57586ca" class="outline-3">
<h3 id="org57586ca"><span class="section-number-3">2.3.</span> An Historical Aside</h3>
<div class="outline-text-3" id="text-2-3">
<p>
In the early days of computing people wrote their programs on <a href="https://en.wikipedia.org/wiki/Computer_programming_in_the_punched_card_era">punch cards</a>. Some see the inspiration as the <a href="https://en.wikipedia.org/wiki/Jacquard_machine">Jacquard machine.</a> There are still programmers alive who can tell you their horror stories of tripping and falling and scattering their punch cards everywhere. Want to know if your program worked? Take it to the main frame data center, drop it off, and come back the next day to get your print out. 
<a href="https://en.wikipedia.org/wiki/Computer_terminal">Terminals</a> came along as an alternative to communicating with big central processors. There was a screen and keyboard. By typing you could send input to the computer that returned the output to your screen. 
The terminals we have today are not true terminals, but emulators. Though few people refer to them as such. We emulate this old way of communicating to the processor because it works and is efficient.
</p>
</div>
</div>
</div>

<div id="outline-container-org8f7ba9c" class="outline-2">
<h2 id="org8f7ba9c"><span class="section-number-2">3.</span> Why use a terminal?</h2>
<div class="outline-text-2" id="text-3">
<p>
You can get more done. You can get it done more quickly. Once you learn to do one hard thing you never have to figure out how to do it again, because you can <a href="https://www.theatlantic.com/technology/archive/2018/10/agents-of-automation/568795/">easily script it</a>. That is why you want to learn to use the terminal
</p>

<p>
Terminals are ubiquitous. They are low in their resource usage. They permit remote logins without the need for sending graphics back and forth. In fact, the remote computer need not have a system installed for displaying windows or even a physical screen attached (called headless). 
</p>

<p>
Knowing how to use a terminal will allow you to use <code>ssh</code> to connect to remote hosts. It will allow you to quickly and efficiently navigate your system, and it will make it easy for you to do things that used to take ages. 
</p>
</div>
