chapters/terminal.org
** A scripting example
   Want to convert and compress a large directory of videos as I did for this course. No need to open up each in an application and click a bunch of mouse clicks. Just write a =bash= script to invoke a command line program to do all the work for you. Go get a cup of coffee and come back when the [[https://xkcd.com/1319/][job is done]].

   #+begin_src sh :eval never :exports code
   for i in *.MP4; 
   do name=`echo "$i" | cut -d'.' -f1`; 
   echo "$name"; 
   ffmpeg -i "$i" -c:v libx264 -b:v 1.5M -c:a aac -b:a 128k "${name}S.mp4";
   done
   #+end_src

   Almost all of this I copied off the Internet where it appeared as an answer to a question from someone else wanting to do essentially the same thing I did. It took me a while to tweak it to my particular use case, but when that was done my problem was solved, /forever./ Every new batch of videos I just put in their own directory and run this script from the command line. Note that this script uses a *for loop*, one of the constructs introduced in the [[file:rstudio.org::*Loops][Loops]] section of the chapter introducing programming concepts. 

   What learning the terminal does is allow you to leverage the knowledge of more people. Thus you get to think about the interesting part of your problems.
   
* Resources
  There are a great many resources on how to use the terminal effectively, but don't go out and read them all. One of the skills to learn in learning to use the computer is to develop your own set of links and resources you can go to when need arises. Don't try to learn everything at once. You will get overwhelmed and discouraged. Instead you learn what you need when the need arises. And if you need to know something more than once, then you spend the time to dive deeper. There are a great many things about using the terminal that I do not know, but I know the ones I use often, and I know where to find more when I need to know more. You should do the same. Here are a few online resources to get you started.

  1. [[https://ryanstutorials.net/linuxtutorial/commandline.php][The command line]]
  2. [[https://ubuntu.com/tutorials/command-line-for-beginners#1-overview][A Short Series of Terminal Lessons from the UbuntuWiki]]
  3. [[https://null-byte.wonderhowto.com/how-to/hack-like-pro-scripting-for-aspiring-hacker-part-1-bash-basics-0149422/][Some Scripting Basics]]
     Most of what you want to do at the command line, at least in the beginning, you can do with typing directly into the terminal. But at some point you will want to write a file, a script, that has all the commands typed into it. They you can run that script from the terminal. This blog post has some basic background for how to get started. 
     Note the use of the term "BASH". This stands for the Bourne Again Shell. Your terminal can use different shells. So while you can use the terms interchangeably most of the time, they don't mean exactly the same thing. The default shell in use by the terminals in Xubuntu is BASH. Another shell favored by many advanced programmers is [[https://ohmyz.sh/][zsh]]. You [[https://wiki.ubuntu.com/ChangingShells][can change the shell]] for your terminal if you like.
  4. [[https://hpc-carpentry.github.io/hpc-shell/05-scripts/index.html][Another Scripting Introduction]]
  5. [[https://medium.com/tech-tajawal/writing-shell-scripts-the-beginners-guide-4778e2c4f609][A More Detailed Treatment of Shell Scripting]]

* Terminal Games

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/453837142?h=8ca9cf87de" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/453837142">Db : Terminal Games (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>I demonstrate in this video some of the exercises under the heading of the Terminal Games in the topic file for this segment.</p>
#+end_export

  In order to give you some structure for your self-directed learning, I have organized a few activities you might try and a few questions you might ask yourself. 
  1. ~ls -la /home/<username>~
     - What does all this output mean?
     - What changes when you leave out the ~-la~?
     - What does the hyphen do?
  2. Can you find the location of your desktop folder in your terminal? 
  3. Can you change to that directory?
     ~cd~
  4. Find out where you are?
     ~pwd~
  5. Can you find out who the computer thinks you are, your user name?
     ~whoami~
  6. Find out how much free space you have on your computer disk.
     ~df -h~
  7. How do you get help for most of these commands?
     Usually ~command --help~ or (~-h~)
  8. How do you find the manual?
     ~man ls~
  9. Navigating
     1. Paths: absolute and relative.
     2. What do those "dots" mean?
     3. What do those slashes mean?
     4. Tab is your friend.
     5. Try the up arrow too.
  10. File ownership
      1. Make a text file from the command line.
         ~touch /home/yourname/Documents/testText.txt~
      2. Who owns it?
  11. Make a directory
      ~mkdir /home/britt/Documents/myFirstDir/~
      Spaces are the enemy. Never use them, but if you have to, escape (~\~) them.
  12. Want more practice? Try some of the [[*Resources][resources]] above. 

* Assessment: Terminal Assessment

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/453837048?h=00f991c86e" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/453837048">Dc : Terminal Assessment Explained (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>What do I recommend you do in this exercise and how do you get started on writing your first shell script.</p>
#+end_export

** Goal
  Demonstrate basic knowledge about and usage of the terminal (aka: command line or shell). 

** Tasks

*Note* This assessment has two parts and asks for two separate files.
  
*** Submit a file that answers the following questions:
   1. What is a terminal?
   2. What shell is your version of Xubuntu using?
   3. What is one other shell you might use?
   4. Give two reasons (not more) why one might want to use the terminal.
   5. I mentioned =ssh=. What does ssh stand for and how does it relate to the concept of a shell?
