book/terminal.html


<div id="outline-container-org7bf4240" class="outline-3">
<h3 id="org7bf4240"><span class="section-number-3">3.1.</span> A scripting example</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Want to convert and compress a large directory of videos as I did for this course. No need to open up each in an application and click a bunch of mouse clicks. Just write a <code>bash</code> script to invoke a command line program to do all the work for you. Go get a cup of coffee and come back when the <a href="https://xkcd.com/1319/">job is done</a>.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #a020f0;">for</span> i<span style="color: #a020f0;"> in</span> *.MP4; 
<span style="color: #a020f0;">do</span> <span style="color: #a0522d;">name</span>=<span style="color: #ff00ff;">`echo "$i" | cut -d'.' -f1`</span>; 
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"$name"</span>; 
ffmpeg -i <span style="color: #8b2252;">"$i"</span> -c:v libx264 -b:v 1.5M -c:a aac -b:a 128k <span style="color: #8b2252;">"${name}S.mp4"</span>;
<span style="color: #a020f0;">done</span>
</pre>
</div>

<p>
Almost all of this I copied off the Internet where it appeared as an answer to a question from someone else wanting to do essentially the same thing I did. It took me a while to tweak it to my particular use case, but when that was done my problem was solved, <i>forever.</i> Every new batch of videos I just put in their own directory and run this script from the command line. Note that this script uses a <b>for loop</b>, one of the constructs introduced in the <a href="rstudio.html#org53c8f2e">Loops</a> section of the chapter introducing programming concepts. 
</p>

<p>
What learning the terminal does is allow you to leverage the knowledge of more people. Thus you get to think about the interesting part of your problems.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd48f0eb" class="outline-2">
<h2 id="orgd48f0eb"><span class="section-number-2">4.</span> Resources</h2>
<div class="outline-text-2" id="text-4">
<p>
There are a great many resources on how to use the terminal effectively, but don't go out and read them all. One of the skills to learn in learning to use the computer is to develop your own set of links and resources you can go to when need arises. Don't try to learn everything at once. You will get overwhelmed and discouraged. Instead you learn what you need when the need arises. And if you need to know something more than once, then you spend the time to dive deeper. There are a great many things about using the terminal that I do not know, but I know the ones I use often, and I know where to find more when I need to know more. You should do the same. Here are a few online resources to get you started.
</p>

<ol class="org-ol">
<li><a href="https://ryanstutorials.net/linuxtutorial/commandline.php">The command line</a></li>
<li><a href="https://ubuntu.com/tutorials/command-line-for-beginners#1-overview">A Short Series of Terminal Lessons from the UbuntuWiki</a></li>
<li><a href="https://null-byte.wonderhowto.com/how-to/hack-like-pro-scripting-for-aspiring-hacker-part-1-bash-basics-0149422/">Some Scripting Basics</a>
Most of what you want to do at the command line, at least in the beginning, you can do with typing directly into the terminal. But at some point you will want to write a file, a script, that has all the commands typed into it. They you can run that script from the terminal. This blog post has some basic background for how to get started. 
Note the use of the term "BASH". This stands for the Bourne Again Shell. Your terminal can use different shells. So while you can use the terms interchangeably most of the time, they don't mean exactly the same thing. The default shell in use by the terminals in Xubuntu is BASH. Another shell favored by many advanced programmers is <a href="https://ohmyz.sh/">zsh</a>. You <a href="https://wiki.ubuntu.com/ChangingShells">can change the shell</a> for your terminal if you like.</li>
<li><a href="https://hpc-carpentry.github.io/hpc-shell/05-scripts/index.html">Another Scripting Introduction</a></li>
<li><a href="https://medium.com/tech-tajawal/writing-shell-scripts-the-beginners-guide-4778e2c4f609">A More Detailed Treatment of Shell Scripting</a></li>
</ol>
</div>
</div>

<div id="outline-container-org94ecb04" class="outline-2">
<h2 id="org94ecb04"><span class="section-number-2">5.</span> Terminal Games</h2>
<div class="outline-text-2" id="text-5">
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/453837142?h=8ca9cf87de" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/453837142">Db : Terminal Games (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>I demonstrate in this video some of the exercises under the heading of the Terminal Games in the topic file for this segment.</p>

<p>
In order to give you some structure for your self-directed learning, I have organized a few activities you might try and a few questions you might ask yourself. 
</p>
<ol class="org-ol">
<li><code>ls -la /home/&lt;username&gt;</code>
<ul class="org-ul">
<li>What does all this output mean?</li>
<li>What changes when you leave out the <code>-la</code>?</li>
<li>What does the hyphen do?</li>
</ul></li>
<li>Can you find the location of your desktop folder in your terminal?</li>
<li>Can you change to that directory?
<code>cd</code></li>
<li>Find out where you are?
<code>pwd</code></li>
<li>Can you find out who the computer thinks you are, your user name?
<code>whoami</code></li>
<li>Find out how much free space you have on your computer disk.
<code>df -h</code></li>
<li>How do you get help for most of these commands?
Usually <code>command --help</code> or (<code>-h</code>)</li>
<li>How do you find the manual?
<code>man ls</code></li>
<li>Navigating
<ol class="org-ol">
<li>Paths: absolute and relative.</li>
<li>What do those "dots" mean?</li>
<li>What do those slashes mean?</li>
<li>Tab is your friend.</li>
<li>Try the up arrow too.</li>
</ol></li>
<li>File ownership
<ol class="org-ol">
<li>Make a text file from the command line.
<code>touch /home/yourname/Documents/testText.txt</code></li>
<li>Who owns it?</li>
</ol></li>
<li>Make a directory
<code>mkdir /home/britt/Documents/myFirstDir/</code>
Spaces are the enemy. Never use them, but if you have to, escape (<code>\</code>) them.</li>
<li>Want more practice? Try some of the <a href="#orgd48f0eb">resources</a> above.</li>
</ol>
</div>
</div>

<div id="outline-container-org66ee84b" class="outline-2">
<h2 id="org66ee84b"><span class="section-number-2">6.</span> Assessment: Terminal Assessment</h2>
<div class="outline-text-2" id="text-6">
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/453837048?h=00f991c86e" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/453837048">Dc : Terminal Assessment Explained (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>What do I recommend you do in this exercise and how do you get started on writing your first shell script.</p>
</div>

<div id="outline-container-orgfe01d78" class="outline-3">
<h3 id="orgfe01d78"><span class="section-number-3">6.1.</span> Goal</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Demonstrate basic knowledge about and usage of the terminal (aka: command line or shell). 
</p>
</div>
</div>

<div id="outline-container-orge550b55" class="outline-3">
<h3 id="orge550b55"><span class="section-number-3">6.2.</span> Tasks</h3>
<div class="outline-text-3" id="text-6-2">
<p>
<b>Note</b> This assessment has two parts and asks for two separate files.
</p>
</div>

<div id="outline-container-org30d6916" class="outline-4">
<h4 id="org30d6916"><span class="section-number-4">6.2.1.</span> Submit a file that answers the following questions:</h4>
<div class="outline-text-4" id="text-6-2-1">
<ol class="org-ol">
<li>What is a terminal?</li>
<li>What shell is your version of Xubuntu using?</li>
<li>What is one other shell you might use?</li>
<li>Give two reasons (not more) why one might want to use the terminal.</li>
<li>I mentioned <code>ssh</code>. What does ssh stand for and how does it relate to the concept of a shell?</li>
</ol>
</div>
<ol class="org-ol">
