chapters/terminal.org
**** File Requirements
    1. Make sure it has your name and student number on it.
    2. Make sure it is in .org format. To do this you will want to, 
       1. open Emacs.
       2. open a new file
       3. =save as= (you can try ~C-x C-s~) with a suitable name and the extension ".org".
       4. Give each question its own heading (start the line with a single "*" and a following space).
       5. Put your answer underneath this heading.
       6. Save.
       7. Upload to the "Terminal" dropbox on Learn.
*** Submit a file that does the following:
   1. Can be run as a shell script.
   2. Echos your name to the terminal.
   3. Prints out the current directory.
   4. Name this file as <yourLastName>_<yourStudentNumber>.sh
   5. Upload to the "Terminal" dropbox on Learn.

*** Last Thoughts 
   Enjoy the power the terminal provides, but don't go overboard. https://xkcd.com/196/



  (video: [[https://vimeo.com/channels/i2c4p/453837048][assessment]])
  [[file:../assessments/terminal.org][terminal.org]]

* Footnotes
[fn:1] [[https://www.howtogeek.com/235101/10-ways-to-open-the-command-prompt-in-windows-10/][CMD]] 

[fn:2] [[https://docs.microsoft.com/en-us/powershell/scripting/getting-started/getting-started-with-windows-powershell?view=powershell-6][Power Shell]]
