book/terminal.html
<li><a id="org6f1db76"></a>File Requirements<br />
<div class="outline-text-5" id="text-6-2-1-1">
<ol class="org-ol">
<li>Make sure it has your name and student number on it.</li>
<li>Make sure it is in .org format. To do this you will want to, 
<ol class="org-ol">
<li>open Emacs.</li>
<li>open a new file</li>
<li><code>save as</code> (you can try <code>C-x C-s</code>) with a suitable name and the extension ".org".</li>
<li>Give each question its own heading (start the line with a single "*" and a following space).</li>
<li>Put your answer underneath this heading.</li>
<li>Save.</li>
<li>Upload to the "Terminal" dropbox on Learn.</li>
</ol></li>
</ol>
</div>
</li>
</ol>
</div>
<div id="outline-container-org9cdf6b1" class="outline-4">
<h4 id="org9cdf6b1"><span class="section-number-4">6.2.2.</span> Submit a file that does the following:</h4>
<div class="outline-text-4" id="text-6-2-2">
<ol class="org-ol">
<li>Can be run as a shell script.</li>
<li>Echos your name to the terminal.</li>
<li>Prints out the current directory.</li>
<li>Name this file as &lt;yourLastName&gt;_&lt;yourStudentNumber&gt;.sh</li>
<li>Upload to the "Terminal" dropbox on Learn.</li>
</ol>
</div>
</div>

<div id="outline-container-org93b8549" class="outline-4">
<h4 id="org93b8549"><span class="section-number-4">6.2.3.</span> Last Thoughts</h4>
<div class="outline-text-4" id="text-6-2-3">
<p>
Enjoy the power the terminal provides, but don't go overboard. <a href="https://xkcd.com/196/">https://xkcd.com/196/</a>
</p>



<p>
(video: <a href="https://vimeo.com/channels/i2c4p/453837048">assessment</a>)
<a href="../assessments/terminal.html">terminal.org</a>
</p>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://www.howtogeek.com/235101/10-ways-to-open-the-command-prompt-in-windows-10/">CMD</a> 
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://docs.microsoft.com/en-us/powershell/scripting/getting-started/getting-started-with-windows-powershell?view=powershell-6">Power Shell</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2023-02-14 Tue 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-02-14 Tue 05:31</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>